# ст 103. № 4.15, 4.18, 4.24 - 4.26.

# 4.15. Написати програми для обчислення:
# a) суми всіх елементів матриці, що належать головній діагоналі;
# b) суми всіх елементів, що належать побічній діагоналі;
# c) суми всіх недіагональних елементів матриці;
# d) кількості нульових елементів матриці.

# 4.18. Напишіть програму пошуку в матриці:
# a) індексів усіх її ненульових елементів;
# b) кількостівсіхїїрізнихелементів.

# 4.24. Розв’язати задачу
# 4.1 використовуючи генератор-вирази для послідовностей.

#  4.26. Розв’язати задачу
#  3.56 використовуючи генератор-вирази для послідовностей.