# 2.23. За літерою-цифрою 𝑑 визначити назву цієї цифри
a = input("Введіть цифру: ")
a = int(a)
l = ["нуль", "один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять"]

if a==0:
  print(l[0])
elif a==1:
  print("Це цифра " + l[1])
elif a==2:
  print("Це цифра " + l[2])
elif a==3:
  print("Це цифра " + l[3])
elif a==4:
  print("Це цифра " + l[4])
elif a==5:
  print("Це цифра " + l[5])
elif a==6:
  print("Це цифра " + l[6])
elif a==7:
  print("Це цифра " + l[7])
elif a==8:
  print("Це цифра " + l[8])
elif a==9:
  print("Це цифра " + l[9])
elif a>9:
  print("Число більше одноцифрового")
elif a<0:
  print("Число мінусове")

input("Натисніть Enter для закінчення")         