# 2.25. Для натурального числа 𝑘 надрукувати фразу "Ми знайшли 𝑘
# грибів у лісі", узгодивши закінчення слова "гриб" з числом 𝑘.

i = input("Введіть число: ")
i = int(i)

n1 = " грибів"
n2 = " гриб"
n3 = " гриба"

if i==0:
  print("Ми знайшли " + str(i) + n1 + " у лісі")
elif i%100>=10 and i%100<=20:
  print("Ми знайшли " + str(i) + n1 + " у лісі")
elif i%10==1:
  print("Ми знайшли " + str(i) + n2 + " у лісі")
elif i%10>=2 and i%10<=4:
  print("Ми знайшли " + str(i) + n3 + " у лісі")
else:
  print("Ми знайшли " + str(i) + n1 + " у лісі")

input("Натисніть Enter для закінчення")  
