#2 Тема: Умовні оператори.
# Питання: Операції відношень. Логічні операції. Приоритет операцій. Логічний тип даних. Умовний оператор. Каскадне розгалуження. Тернарний умовний оператор.
# Завдання: ст. 42-44. № 2.9, 2.17, 2.18, 2.19, 2.23-2.26

# 2.9 Скласти програму перевірки належності точки площини (𝑥, 𝑦) до
# зафарбованої області
class CheckN:
    pass

# 2.17 Перевірити, чи існує трикутник із заданими сторонами 𝑎,𝑏,𝑐. Якщо так, то визначити, який він:
# a) гострокутний;
# b) прямокутний;
# c) тупокутний.
class CheckIfT:
    pass

# 2.18 Визначити, скільки розв’язків має рівняння та розв'язати його:
# a) 𝑎𝑥2 + 𝑏𝑥 + 𝑐 = 0;
# b) 𝑎𝑥4 + 𝑏𝑥2 + 𝑐 = 0.
class CheckRes:
    pass

# 2.19 Визначити, скільки розв’язків має система рівнянь і розв'язати її:
# a) {𝑎1𝑥+𝑏1𝑦+𝑐1 =0, 𝑎2𝑥+𝑏2𝑦+𝑐2 =0;
# b){|𝑥|+|𝑦|=1, 𝑎𝑥+𝑏𝑦+𝑐=0.
class CheckResT:
    pass

# 2.23 За літерою-цифрою 𝑑 визначити назву цієї цифри.
class DNum:
    pass

# 2.26 Задано тризначне натуральне число.
# Записати його словами, вважаючи, що це число означає деяку суму грошей
# (у гривнях або іншій валюти). Наприклад, для числа 256 треба записати "двісті п’ятдесят шість гривень".
class InTNum:
    pass