# 4 Тема: Рекурентні співвідношення.
# Питання: Рекурентні співвідношення першого порядку. Рекурентні співвідношення старших порядків. Системи рекурентних співвідношень.
# Завдання: ст. 76. No 3.39, 3.41, 3.42. 3.50, 3.51

# 3.39 Дано натуральне число 𝑛. Написати програми для обчислення значень виразів при заданому значенні 𝑥:
# a) 𝑥𝑛 +𝑥𝑛−1+...+𝑥2 +𝑥+1;
# b) 1+(𝑥−1)+(𝑥−1)2+...+(𝑥−1)𝑛;
# c) 𝑦=𝑥2𝑛+𝑥2𝑛−1+...+𝑥4+𝑥2+1,
# d) (𝑛𝑥)𝑛+((𝑛−1)𝑥)𝑛−1+...+(2𝑥)2+𝑥.
# e)1+1+1 +...+1 ; 𝑥2+1 (𝑥2+1)2 (𝑥2+1)𝑛
#        f) 1 + sin𝑥+. . . +sin𝑛𝑥. πππ
# g) cosπ+cos2 +cos4+...+cos2𝑛.

class SumRo:
    pass

# 3.41 Скласти програми для обчислення сум: a) 𝑆𝑛 =1+2+3+...+𝑛;
# # b) 𝑆𝑛 =1−2+3+...+(−1)𝑛𝑛;
# # 11 𝑛−11 c) 𝑆𝑛=1− + −⋯+(−1)
# # 23𝑛
# # d)𝑆𝑛=1+1+⋯+ 1 1⋅2 2⋅3 (𝑛−1)⋅𝑛
# # 2 4 (−2)𝑛 e)𝑆𝑛=1− + +⋯+
# # f) 𝑆𝑛= g) 𝑆𝑛 =
# # ;
# #  1!2! 𝑛!
# # 1 2 3 (−1)𝑛(𝑛−1)
# # − + −⋯+ 234 𝑛
# # ;
# #  1 + 2 + 4 +⋯+ 2𝑛 ; 1!! 3!! 5!! (2𝑛+1)!!

class SumR:
    pass

# 3.42 Створити програми для обчислення добутків: h) 𝑃 =(1+1)(1+1)...(1+1)
# 𝑛 12 22 𝑛2 𝑛1111
# i) 𝑃 =∏ (1− )=(1− )(1− )...(1− );
# 𝑛 𝑖=2 𝑖2
# j) 𝑃 =∏𝑛 (2+1); 𝑛 𝑖=1 𝑖!
# 22 32
# 𝑛2
# k) 𝑃 =∏𝑛 𝑖+1; 𝑛 𝑖=1𝑖+2
# l) 𝑃=∏𝑛 1; 𝑛 𝑖=1 𝑖+1!
# 22446
# n) 𝑃𝑛 = ⋅ ⋅ ⋅ ⋅ ⋅..., n–співмножників.

class PrDub:
    pass

# 3.50 Створити програми для обчислення сум:
# a) ∑𝑛𝑘=12𝑘𝑎𝑘,
# 𝑛 3𝑘 b) 𝑆𝑛=∑𝑘=1𝑎, 𝑘
# 𝑛 𝑘! c) 𝑆𝑛 = ∑𝑘=1 𝑎 , 𝑘
# де 𝑎1 =0, 𝑎2 =1, 𝑎𝑘 =𝑎𝑘−1 +𝑘𝑎𝑘−2, 𝑘≥3; 𝑎𝑘−1
# де𝑎1=1,𝑎2=1, 𝑎𝑘= 𝑘 +𝑎𝑘−2, 𝑘≥3; 𝑎𝑘−2
# де 𝑎1 = 1, 𝑎2 = 1, 𝑎𝑘 = 𝑎𝑘−1 + 2𝑘 , 𝑘 ≥ 3;
# d) 𝑆𝑛 =∑𝑘=1𝑘!𝑎𝑘,
# де 𝑎1 =0, 𝑎2 =1, де 𝑎1 = 𝑎2 =𝑎3 =1,
# 𝑎𝑘−2
# 𝑎𝑘 =𝑎𝑘−1 +(𝑘−1)!, 𝑘≥3;

class ObseSum:
    pass

# 3.51 Створити програми для обчислення сум:
# 𝑏1 =1,𝑏2 =1,
# {𝑏𝑘 =𝑏𝑘−1 +𝑎𝑘−1 𝑘≥3;
# 𝑛 𝑎𝑘𝑏𝑘 b) 𝑆𝑛 = ∑𝑘=1 (𝑘+1)!,
# 𝑘
# 2𝑘
# 𝑛
# a) 𝑆𝑛 = ∑𝑘=1 𝑎 +𝑏 ,
# 𝑎1 =0,𝑎2 =1, де{𝑎𝑘 =𝑎𝑘−1 +𝑎𝑘−2𝑏𝑘
# 𝑘𝑘
# де{𝑎1 =𝑢, 𝑎𝑘=2𝑏𝑘−1+𝑎𝑘−1
# 𝑢, 𝑣 – задані дійсні числа;
# 2𝑘
# c) ∑𝑘=1 (1+𝑎𝑘2+𝑏𝑘2)𝑘!,
# {𝑏1 =𝑣,
# 𝑏 =2𝑎2
# 𝑘 𝑘−1
# 𝑘≥2; 𝑘−1
# 𝑛
# d) ∑𝑛𝑘=1(𝑎𝑘)𝑘 𝑏𝑘
# 3.52. Створити програми для обчислення добутків:
# §3 Циклічні програми
#  𝑛
# d) 𝑆𝑛 =∑𝑘=1𝑘!𝑎𝑘,
# де 𝑎1 =0, 𝑎2 =1, де 𝑎1 = 𝑎2 =𝑎3 =1,
# 𝑎𝑘−2
# 𝑎𝑘 =𝑎𝑘−1 +(𝑘−1)!, 𝑘≥3;
# +𝑏
#  𝑛 𝑎𝑘
# e) ∑𝑘=11+𝑏 ,

class ObSum:
    pass