# 4.1. Дано список натуральних чисел. Знайти кількість:
# a) парних компонентів;
# b) компонентів, що діляться на 3 або 5;
# c) нульових компонентів;

num_a = 0
num_b = 0
num_c = 0
list = [5, 7 , 0, 1, 12, 7, 8, 3, 3]

for i in list:
    n = i
    while n > 0:
        n -= 2
    if n == 0:
        num_a += 1
    n = i
    while n > 0:
        n -= 3
    if n == 0:
        num_b += 1
    elif n == 5:
        num_b += 1
    n = i
    if n == 0:
      num_c += 1

print("Кількість парних компонентів: " + str(num_a))
print("Кількість компонентів, що діляться на 3 або 5: " + str(num_b))
print("Кількість нульових компонентів: " + str(num_c))

input("Натисніть Enter для завершення")