# Тема: Списки.
# Питання: Впорядковані колекції. Список. 3 способи створення списків. Індексація. Поелементна робота зі списком. Зрізи. Операції над списками. Введення списків з клавіатури. Обхід списку: ітеруванням, за індексами, за допомогою функції enumerate. Моделювання роботи з матрицями.
# Завдання: ст. 102. № 4.1 a)-c), 4.2 a) b), 4.12, 4.13.

# 4.1 Дано список натуральних чисел. Знайти кількість:
# a) парних компонент;
# b) компонент,що діляться на 3 або 5;
# c) нульових компонент;

class GetUlNum:
    pass


# 4.2. Дано список натуральних чисел. Використовуючи оператор створення
# списку, побудувати список, що містить:
# a) всіпарніелементизаданогосписку;
# b) всі елементи заданого списку, що є повними квадратами;

class GetUlNumT:
    pass


# 4.12. Дано два впорядкованих списки. Не використовуючи функцію
# сортування, об'єднати ці списки у один впорядкований список.

class GetTUl:
    pass


# 4.13. Дано список, що складається з коефіцієнтів многочлена
# 𝑃𝑛(𝑥)=𝑎0 ∗𝑥𝑛 +𝑎1 ∗𝑥𝑛−1+...+𝑎𝑛−1 ∗𝑥+𝑎𝑛
# Обчислити:
# a) значення многочлена при заданому значенні х;
# b) похідноївідмногочленапризаданомузначенніх;
# c) інтеграла від много члена 𝑃𝑛 (𝑥) на заданому відрізку.

class Ulm:
    pass
