# 3 Тема: Оператори повторення.
# Питання: Правила виконання оператора while. Цикл по колекції. Функція range.
# Переривання та продовження циклів. Колекції.
# Завдання: ст. 73. No 3.1, 3.47, 3.48, 3.4, 3.19, 3.32, 3.34, 3.67, 3,68.

# 3.1 Вивести на екран такий рядок:
# n! = 1*2*3*4*5*...*n
# де n – введене з клавіатури число.

a = int(input("Введіть число: "))
b = 1
while a > 1:
    b *= a
    a -= 1
print("Факторіал введеного числа дорівнює:")
print(b)

input("Натисніть enter для завершення")

# 3.47 Написати програму для обчислення
# a) факторіаланатуральногочисла𝑛!;
# b) подвійногофакторіаланатуральногочисла𝑛!!.


k = m = 1
element = input("Введіть номер елементу: ")
element = int(element)
for n in range(int(element-2)):
    tmp = k + m
    k = m
    m = tmp
print(str(element)+" елемент послідовності дорівнює " + str(m))

input("Натисніть Enter для завершення програми")

# 3.48 Знайти k-ту цифру послідовності:
# a) 110100100010000 ... , у якій виписані підряд степені 10;
# b) 123456789101112 ... , у якій виписані підряд усі натуральні числа;
# c) 149162536 ... , у якій виписані підряд квадрати всіх натуральних чисел;
# d) 01123581321...,уякійвиписаніпідрядусічислаФібоначчі.

class CalcK:
    pass

# 3.4 Написати програму друку таблиці значень функції 𝑦 = sin(𝑥) на відрізку [0; 1] з кроком h = 0.1.


import math

print("Таблиця")
n = 0
while n < 1:
    print("|x|y|")
    print("|" + str(n) + "|" + str(math.sin(n)))
    n += 0.1

input("Натисніть Enter для завершення")

# 3.19 Створити програму, яка з’ясовує, чи входить задана цифра до запису заданого натурального числа.


a = int(input("Введіть число: "))
b = int(input("Введіть цифру: "))
for i in str(a):
    if i == str(b):
        print("Цифра входить до заданого числа")

input("Натисніть Enter для завершення")

# 3.32 Натуральне число називається паліндромом, якщо його запис читається однаково зліва направо і справа наліво
# (наприклад, 1, 393, 4884). Скласти програму, що визначає, чи є задане натуральне число 𝑛 паліндромом.


n = int(input("Введіть натуральне число: "))
if str(n) == str(n)[::-1]:
    print("Це паліндром")
else:
    print("Це не паліндром")

input("Натисніть Enter для завершення")

# 3.34 Скласти програму знаходження всіх простих дільників заданого
# натурального числа.

class CalcSimNum:
    pass

# 3.67 Методом ділення відрізка навпіл, знайти корінь рівняння sin𝑥 = 𝑥/3 із заданою точністю ε на відрізку [1.6, 3].


import math

n = int(input("Введіть х: "))
result = math.sin(n) / 3
print(result)

input("Натисніть Enter для завершення")

# 3.68 Із заданою точністю ε знайти корінь рівняння 𝑥3 + 4𝑥2 + 𝑥 − 6, що належить відрізку [0,2].

class CulcRo:
    pass

