# ст .139. № 6.10, 6.11, 6.12, 6.16.

# 6.10. Дано список країн та міст, що знаходяться у кожній з заданих країн.
# Для заданого міста знайдіть країну у якій воно знаходиться.

# 6.11. Відомості про автомобіль складаються з його марки, унікального номера і прізвища власника. Дано словник, який містить відомості про кілька автомобілів. Скласти програми знаходження
# a) прізвищвласниківномерівавтомобілівданоїмарки;
# b) кількості автомобілів кожної марки.

# 6.12. Нехай словник моделює стан гаманця у такий спосіб:
# значення банкноти (номінал) – це ключ, а кількість банкнот цього номіналу – значення.
# якщо у гаманці відсутня банкнота певного номіналу, то такий елемент відсутній у гаманці (не допускається у словнику наявність пар типу {20:0})
# Потрібно порахувати суму коштів, що міститься у гаманці. Вважається, що повний перелік номіналів банкнот відомий.

# 6.11. Відомості про автомобіль складаються з його марки, унікального номера і прізвища власника. Дано словник, який містить відомості про кілька автомобілів. Скласти програми знаходження
# a) прізвищвласниківномерівавтомобілівданоїмарки;
# b) кількості автомобілів кожної марки.

# 6.16. Задано англо-український словник. Для кожного англійського слова у
# цьому словнику може бути декілька перекладів – синонімів.
# Написати програму, що по заданому словнику будує україно-англійський словник.


