# ст. 122. № 5.1, 5.5, 5.27, 5.31, 5.32, 5.39.

# 5.1. Вивести на екран таку таблицю символів:
#      Aa Bb Cc Dd Ee Ff Gg Hh
#      Ii Jj Kk Ll Mm Nn Oo Pp
#      Qq Rr Ss Tt Uu Vv Ww Xx

# 5.5. Дано рядок, що містить принаймні одну цифру. Знайти
# a) максимальнуцифру,щоміститьсяурядку;
# b) цифру, що входить до рядка найбільшу кількість разів;
# c) суму цифр, що входять до рядка.
# d) цифри,щотрапляютьсяурядкурівнодварази;
# e) цифри,що не міститься у рядку;

# 5.27. Скласти програму виведення на друк усіх цифр, які входять у заданий рядок, та окремо – решту символів,
# зберігаючи при цьому взаємне розташування символів у кожній із цих двох груп.

# 5.31. Заданий текст, що містить послідовність слів. Визначити кількість слів, які:
# a) містятьсявтексті;
# b) починаютьсяіззаданоїлітери;
# c) закінчуються заданою літерою;
# d) починаютьсяізакінчуютьсязаданоюлітерою;

# 5.32. Заданий текст, що містить послідовність слів. Знайти
# a) найкоротшесловорядка,йогодовжинутапозиціюурядку;
# b) найдовшесловорядка,йогодовжинутапозиціюурядку;
# c) кількість входжень заданої літери в 𝑛-те, починаючи з початку слово
# даної послідовності;
# d) слово, що містить найбільшу кількість голосних літер, кількість голосних
# літер у цьому слові та позицію цього слова у тексті;
# e) всі слова, які є натуральними числами;
# f) всі слова, які є паліндромами (симетричними);
# g) всі слова, які є ідентифікаторами;

# 5.39. Як відомо, римська система числення використовує символи M, D, C, L, X, V та I для чисел
# 1000, 500, 100, 50, 10, 5 та 1 відповідно. Інші числа записуються використовуючи різні комбінації вищенаведених символів,
# наприклад

# I - 1 VII - 7
# XLVI - 46       CCCII - 302
# II - 2 VIII - 8
# L - 50          CDXLI - 441
# III - 3 IX - 9
# LXXV - 75       ID - 499
# IV - 4 X - 10
# XCII - 92       D - 500
# V - 5 XVIII - 18
# IC - 99         DCXCV - 695
# VI - 6 XXXI - 31
# C - 100 CM - 900
